In [10]:
%matplotlib inline
import pandas as pd

In [47]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [8]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

### How many movies are listed in the titles dataframe?

In [11]:
cast=pd.read_csv('/content/drive/My Drive12/cast.csv')
titles = pd.read_csv('/content/drive/My Drive12/titles.csv')
rdates=pd.read_csv('/content/drive/My Drive12/release_dates.csv')

In [48]:
print("Number of movies listed in title dataframe=",titles['title'].count())

Number of movies listed in title dataframe= 244914

### What are the earliest two films listed in the titles dataframe?

In [ ]:
titles.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

### How many movies have the title "Hamlet"?

In [ ]:
t1=titles[titles['title']=='Hamlet']
print("total number of movies  having title Hamlet=",t1['title'].count())

total number of movies  having title Hamlet= 20

In [ ]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are titled "North by Northwest"?

In [47]:

t2=titles[titles['title']=='North by Northwest']
print("total number of movies having title North by Northwest=",t2['title'].count())

total number of movies having title North by Northwest= 1

### When was the first movie titled "Hamlet" made?

In [46]:
sorted(titles['year'][titles['title']=='Hamlet'])[0]

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [ ]:
n=titles[titles['title']=='Treasure Island']
n.sort_values("year")

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [ ]:
t=titles[titles['year']==1950]
print("The number of movies made in the year 1950 =",t['title'].count())

The number of movies made in the year 1950 = 1113

### How many movies were made in the year 1960?

In [ ]:
tt=titles[titles['year']==1960]
print("The number of movies made in the year 1960 =",tt['title'].count())

The number of movies made in the year 1960 = 1549

### How many movies were made from 1950 through 1959?

In [ ]:
b10=titles[(titles.year>=1950) & (titles.year<=1959)]
print("The total no of movies made between 1950 to 1959 is ",b10['year'].count())

The total no of movies made between 1950 to 1959 is  12934

### In what years has a movie titled "Batman" been released?

In [ ]:
bat=titles[titles['title']=='Batman']
bat

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [ ]:
c=cast[cast['title']=='Inception'].count()
print("The total number of character in Inception movie are=",c['character'])

The total number of character in Inception movie are= 78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [ ]:
c=cast[cast['title']=='Inception']
a=c.isna().sum()
print(a['n'], "roles in inception are not ranked by n value")

27 roles in inception are not ranked by n value

### But how many roles in the movie "Inception" did receive an "n" value?

In [ ]:
c=cast[cast['title']=='Inception']
print(c['n'].notnull().sum(),'roles in inception did receive an n value')

51 roles in inception did receive an n value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [13]:
nn=cast[cast['title']=='North by Northwest']
a=nn.dropna()
a.sort_values("n", axis = 0, ascending = True)

                      title  year  ...                    character     n
871426   North by Northwest  1959  ...           Roger O. Thornhill   1.0
3518333  North by Northwest  1959  ...                  Eve Kendall   2.0
1457165  North by Northwest  1959  ...              Phillip Vandamm   3.0
3157232  North by Northwest  1959  ...              Clara Thornhill   4.0
356707   North by Northwest  1959  ...                The Professor   5.0
3048272  North by Northwest  1959  ...                Mrs. Townsend   6.0
1695173  North by Northwest  1959  ...              Lester Townsend   7.0
1275337  North by Northwest  1959  ...                      Leonard   8.0
2447081  North by Northwest  1959  ...                     Valerian   9.0
1811387  North by Northwest  1959  ...              Victor Larrabee  10.0
665768   North by Northwest  1959  ...                        Licht  11.0
2295714  North by Northwest  1959  ...                   Auctioneer  12.0
464736   North by Northwest  1959  ...                    Dr. Cross  13.0
1508344  North by Northwest  1959  ...               Sergeant Flamm  14.0
206471   North by Northwest  1959  ...               Captain Junket  15.0
1384780  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0

[16 rows x 6 columns]

In [ ]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [45]:
nn=cast[cast['title']=='Sleuth']
a=nn[nn['year']==1972]
b=a.sort_values("n", axis = 0, ascending = True)
b[['name','n']]

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [44]:
nn=cast[cast['title']=='Sleuth']
a=nn[nn['year']==2007]
b=a.sort_values("n", axis = 0, ascending = True)
b[['character','n']]

                 character    n
326774              Andrew  1.0
1293634               Milo  2.0
1805907        Man on T.V.  3.0
260242   Other Man on T.V.  NaN
373877   Inspector Doppler  NaN
2724552    Marguerite Wyke  NaN
3370424             Maggie  NaN

Index(['title', 'year', 'country', 'date'], dtype='object')

### How many roles were credited in the silent 1921 version of Hamlet?

In [43]:
len(cast["character"][(cast["year"]==1921) & (cast["title"]=="Hamlet")])

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [41]:
len(cast["character"][(cast["year"]==1996) & (cast["title"]=="Hamlet")])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [ ]:
a=cast[cast['character']=='Hamlet']
print(a['character'].count(),"Hamlet roles have been listed in all film credits through history.")

96 Hamlet roles have been listed in all film credits through history.

### How many people have played an "Ophelia"?

In [40]:
b=cast[["character","name"]][cast["character"]=="Ophelia"]
print("people played Ophelia role",len(b["name"].value_counts()))

people played Ophelia role 115

### How many people have played a role called "The Dude"?

In [ ]:
nn=cast[cast['character']=='The Dude']
print(nn['character'].count(),"people have played role called The Dude.")

19 people have played role called The Dude.

### How many people have played a role called "The Stranger"?

In [35]:
b=cast[["character","name"]][cast["character"]=="The Stranger"]
print(len(b["name"].value_counts()),"people have played role called The Stranger.")

202 people have played role called The Stranger.

### How many roles has Sidney Poitier played throughout his career?

In [34]:
df=cast["character"][cast["name"]=="Sidney Poitier"]
print("Sidney Poitier has played",len(df.value_counts()),"roles throughout his career")

Sidney Poitier has played 41 roles throughout his career

### How many roles has Judi Dench played?

In [33]:
df=cast["character"][cast["name"]=="Judi Dench"]
print("Judi Dench has played",len(df.value_counts()),"roles.")

Judi Dench has played 46 roles.

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [32]:
nn=cast[(cast['name']=='Cary Grant') & (cast['year']>=1940) & (cast['year']<=1949) & (cast['n']==2)]
a=nn.sort_values("year", axis = 0, ascending = True)
a[["character","year"]]

          character  year
871423   Nick Arden  1940
871433  Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [31]:
nn=cast[(cast['name']=='Cary Grant') & (cast['year']>=1940) & (cast['year']<1950) & (cast['n']==1)]
a=nn.sort_values("year", axis = 0, ascending = True)
a[["character",'year']]

                                   character  year
871448                           Matt Howard  1940
871407                          Walter Burns  1940
871450                    C. K. Dexter Haven  1940
871438                      Johnnie Aysgarth  1941
871452                          Leopold Dilg  1942
871429                 Patrick 'Pat' O'Toole  1942
871398                         Capt. Cassidy  1943
871422  Joe Adams -posing as Joe Bascopolous  1943
871430                           Jerry Flynn  1944
871390                     Mortimer Brewster  1944
871425                            Ernie Mott  1944
871424                           Cole Porter  1946
871427                                Devlin  1946
871444                           Dick Nugent  1947
871445                                Dudley  1947
871421                         Jim Blandings  1948
871402                     Dr. Madison Brown  1948
871411                 Captain Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [ ]:
nn=cast[cast['type']=='actor']
a=nn[(nn.year>=1950) & (nn.year<=1959)]
a['character'].count()

157738

### How many roles were available for actresses in the 1950s?

In [ ]:
nn=cast[cast['type']=='actress']
a=nn[(nn.year>=1950) & (nn.year<=1959)]
a['character'].count()

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [29]:
c=cast[(cast["year"]>=cast["year"].min()) &(cast["year"]<=1980)& (cast["n"]==1)] 
c['character'].count()

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [27]:
c=cast[(cast["year"]>=cast["year"].min()) &(cast["year"]<=1980)& (cast["n"]!=1)] 
c['character'].count()

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [ ]:
nn=cast[cast['year']==1980]
print(nn['n'].isna().sum(), "roles through 1980 were minor enough that they did not warrant a numeric n rank")

4466 roles through 1980 were minor enough that they did not warrant a numeric n rank